{
    "messages": [
        {
            "text": "Thanks!", 
            "type": "message", 
            "user": "U4NUR5R3L", 
            "ts": "1498011753.806025"
        }, 
        {
            "text": "Word. Don't forget, that you are a super smart cat, and you got this! We're in the home stretch...", 
            "type": "message", 
            "user": "U34BY2K3K", 
            "ts": "1498011711.800676"
        }, 
        {
            "text": "i’m doing another run with Frank at 8 in the morn and about to do a practice run for Stuart here in an hour", 
            "type": "message", 
            "user": "U4NUR5R3L", 
            "ts": "1498011633.791211"
        }, 
        {
            "text": "Think Data Science Haiku. You just need to leave the audience with the _impression_ that you really know this shit! Let them come up and ask afterward for deeper insight.\n\nLet me know if you need more practice or help, I should be in around 9.", 
            "type": "message", 
            "user": "U34BY2K3K", 
            "ts": "1498011588.785789"
        }, 
        {
            "text": "I think it’ll come together, just no time to really explain much…", 
            "type": "message", 
            "user": "U4NUR5R3L", 
            "ts": "1498008612.382659"
        }, 
        {
            "text": "well, content was said to be good, but too much of it, I went WAY over. So I am practicing again at 8 with Frank before doing for James tomorrow", 
            "type": "message", 
            "user": "U4NUR5R3L", 
            "ts": "1498008598.380546"
        }, 
        {
            "text": "Hey sorry I missed the pres. How did it go?", 
            "type": "message", 
            "user": "U34BY2K3K", 
            "ts": "1498004149.761079"
        }, 
        {
            "text": "word, thanks for the advice", 
            "type": "message", 
            "user": "U4NUR5R3L", 
            "ts": "1497552525.507270"
        }, 
        {
            "text": "oh, scrum definitely showed me my sticking points yesterday!", 
            "type": "message", 
            "user": "U4NUR5R3L", 
            "ts": "1497552519.505051"
        }, 
        {
            "text": "No blood, no foul. Do what you need, just don't suffer in silence and try to grind it out...that's why we scrum, to find the sticking points early.", 
            "type": "message", 
            "user": "U34BY2K3K", 
            "ts": "1497552482.491766"
        }, 
        {
            "text": "i’ll be there bright and early tomorrow. I just had to take some time by myself. my attitude wasn’t good yesterday and that’s not fair to others.", 
            "type": "message", 
            "user": "U4NUR5R3L", 
            "ts": "1497552354.444430"
        }, 
        {
            "text": "Don't struggle by yourself for more than an hour or two...you have a building full of experienced people here so ask for help!", 
            "type": "message", 
            "user": "U34BY2K3K", 
            "ts": "1497552301.424265"
        }, 
        {
            "text": "I’m just worried my app won’t actually demonstrate my work, BUT I’m going to get my readme to Ky status before Thursday as well", 
            "type": "message", 
            "user": "U4NUR5R3L", 
            "ts": "1497552299.423354"
        }, 
        {
            "text": "good to know, I tend to be blunt when I get frustrated. I’m working as hard as I can to get something working by tomorrow. I would honestly REALLY appreciate some time tying up loose ends on flask though tomorrow", 
            "type": "message", 
            "user": "U4NUR5R3L", 
            "ts": "1497552241.402610"
        }, 
        {
            "text": "Shiiiit, I have two older brothers and a wife...that wasn't shit homie.", 
            "type": "message", 
            "user": "U34BY2K3K", 
            "ts": "1497552131.362410"
        }, 
        {
            "text": "by the way, sorry about any attitude I gave you yesterday on flask stuff, i’ve just been working morning till late, lack of sleep and stress/pressure to have something that is impressive", 
            "type": "message", 
            "user": "U4NUR5R3L", 
            "ts": "1497552102.351638"
        }, 
        {
            "text": "thx", 
            "type": "message", 
            "user": "U4NUR5R3L", 
            "ts": "1497552019.322082"
        }, 
        {
            "text": "cool, I’m not where near your comfort level speaking in front of people! but yeah, I’ll just do it over and over again, make my roommates listen, etc.", 
            "type": "message", 
            "user": "U4NUR5R3L", 
            "ts": "1497552018.321432"
        }, 
        {
            "text": "We can practice the presentation a few times as well.", 
            "type": "message", 
            "user": "U34BY2K3K", 
            "ts": "1497551985.309697"
        }, 
        {
            "text": "cool, I get a little nervous in front of crowds, but I”ll just make a presentation happen, that way can work on presentation after code freeze if need be", 
            "type": "message", 
            "user": "U4NUR5R3L", 
            "ts": "1497551940.293001"
        }, 
        {
            "text": "A physical poster looks to be a required deliverable if you go that route. I think deadline is tuesday first thing.", 
            "type": "message", 
            "user": "U34BY2K3K", 
            "ts": "1497551872.267892"
        }, 
        {
            "text": "although I heard some people were just going screen no poster…", 
            "type": "message", 
            "user": "U4NUR5R3L", 
            "ts": "1497551694.201423"
        }, 
        {
            "text": "when is the poster due if we go that route? as in printing time?", 
            "type": "message", 
            "user": "U4NUR5R3L", 
            "ts": "1497551676.194800"
        }, 
        {
            "text": "If the stuff we covered in lecture isn't cutting it for you, there are other tools available as well. You can check in with Jenn Key, I think was using Scrapey for some of her project. I'll be in around 12ish otherwise.", 
            "type": "message", 
            "user": "U34BY2K3K", 
            "ts": "1497454221.349088"
        }, 
        {
            "text": "hey Steve, I need to make an appointment at some time today to get help scraping links to images off boardgamegeek. I successfully got one set, but after 4 hours last time I decided to go to bed with nothing to show for my time!", 
            "type": "message", 
            "user": "U4NUR5R3L", 
            "ts": "1497452133.434851"
        }, 
        {
            "text": "In the class...I have a few minutes.", 
            "type": "message", 
            "user": "U34BY2K3K", 
            "ts": "1496776137.016404"
        }, 
        {
            "text": "and free", 
            "type": "message", 
            "user": "U4NUR5R3L", 
            "ts": "1496774862.613160"
        }, 
        {
            "text": "are you in the building?", 
            "type": "message", 
            "user": "U4NUR5R3L", 
            "ts": "1496774849.607273"
        }, 
        {
            "text": "cool, I have the flow going so I’ll just start small and figure out structure before I build up. The more I thought about it, I’ll probably be playing around with those variables a lot depending on where I’m headed. thx!!", 
            "type": "message", 
            "user": "U4NUR5R3L", 
            "ts": "1495059575.072436"
        }, 
        {
            "text": "You could make each individual piece of info into it's own field name / value pair. Otherwise you would be putting the whole list of values into one cell in pandas. You can fix this in pandas but it kinda sucks. Might be better to just have a bunch of mechanics related fields. Just my two cents...", 
            "type": "message", 
            "user": "U34BY2K3K", 
            "ts": "1495047081.720548"
        }, 
        {
            "text": "to be clear, I haven’t created the mongo db collection yet, I just want to make sure that the schema I choose makes it easy to query in the future and put into a pd", 
            "type": "message", 
            "user": "U4NUR5R3L", 
            "ts": "1495034775.709496"
        }, 
        {
            "text": "Hey Steve, do you have any tips for structuring a mongodb collection that I will want to read into a pandas dataframe? I have single variables that seem straightforward (i.e. ‘avg_rating’: 8.4512), however I have other variables that are list of tuples at the moment: ```mechanics: [(2080, 'Area Control / Area Influence'), (2676, 'Grid Movement'), (2015, 'Variable Player Powers')]```\nI can structure this however would be most advantageous. Any ideas?", 
            "type": "message", 
            "user": "U4NUR5R3L", 
            "ts": "1495034099.467549", 
            "edited": {
                "user": "U4NUR5R3L", 
                "ts": "1495034259.000000"
            }
        }, 
        {
            "text": "cool", 
            "type": "message", 
            "user": "U34BY2K3K", 
            "ts": "1494450865.345111"
        }, 
        {
            "text": "great! getting organized…30/hour", 
            "type": "message", 
            "user": "U4NUR5R3L", 
            "ts": "1494450797.328227"
        }, 
        {
            "text": "Anytime bud...let's game it up!", 
            "type": "message", 
            "user": "U34BY2K3K", 
            "ts": "1494450561.268074"
        }, 
        {
            "text": "Steve, I’m on your queue at some point this afternoon please!", 
            "type": "message", 
            "user": "U4NUR5R3L", 
            "ts": "1494450374.218570"
        }
    ], 
    "channel_info": {
        "members": [
            "U4NUR5R3L", 
            "U34BY2K3K"
        ]
    }
}